{
  "text": {
    " ": 0,
    "x": 629,
    "i": 394,
    "n": 477,
    " x": 163,
    "xi": 631,
    "in": 407,
    "n ": 478,
    " xi": 164,
    "xin": 632,
    "in ": 408,
    " xin": 165,
    "xin ": 633,
    "c": 286,
    "h": 358,
    "à": 644,
    "o": 509,
    " c": 46,
    "ch": 291,
    "hà": 374,
    "ào": 650,
    "o ": 510,
    " ch": 47,
    "chà": 295,
    "hào": 377,
    "ào ": 651,
    " chà": 49,
    "chào": 296,
    "hào ": 378,
    "b": 266,
    "ạ": 694,
    " b": 35,
    "bạ": 280,
    "ạn": 695,
    " bạ": 42,
    "bạn": 281,
    "ạn ": 696,
    " bạn": 43,
    "bạn ": 282,
    "e": 323,
    "l": 428,
    " h": 76,
    "he": 364,
    "el": 325,
    "ll": 436,
    "lo": 440,
    " he": 80,
    "hel": 365,
    "ell": 327,
    "llo": 438,
    "lo ": 441,
    " hel": 81,
    "hell": 366,
    "ello": 329,
    "llo ": 439,
    "u": 598,
    "ổ": 723,
    "bu": 277,
    "uổ": 615,
    "ổi": 724,
    "i ": 395,
    " bu": 40,
    "buổ": 278,
    "uổi": 616,
    "ổi ": 725,
    " buổ": 41,
    "buổi": 279,
    "uổi ": 617,
    "s": 549,
    "á": 654,
    "g": 342,
    " s": 137,
    "sá": 559,
    "án": 659,
    "ng": 482,
    "g ": 343,
    " sá": 140,
    "sán": 562,
    "áng": 660,
    "ng ": 483,
    " sán": 142,
    "sáng": 563,
    "áng ": 661,
    "t": 564,
    "ố": 718,
    " t": 143,
    "tố": 595,
    "ối": 719,
    " tố": 155,
    "tối": 596,
    "ối ": 720,
    " tối": 156,
    "tối ": 597,
    "a": 247,
    "p": 519,
    " l": 98,
    "la": 430,
    "ap": 260,
    "pt": 521,
    "to": 576,
    "op": 511,
    "p ": 520,
    " la": 99,
    "lap": 431,
    "apt": 261,
    "pto": 522,
    "top": 577,
    "op ": 512,
    " lap": 100,
    "lapt": 432,
    "apto": 262,
    "ptop": 523,
    "top ": 578,
    "d": 310,
    " d": 59,
    "de": 314,
    "l ": 429,
    " de": 60,
    "del": 315,
    "ll ": 437,
    " del": 61,
    "dell": 316,
    "ell ": 328,
    " g": 67,
    "gi": 349,
    "iá": 415,
    "á ": 655,
    " gi": 70,
    "giá": 350,
    "iá ": 416,
    " giá": 71,
    "giá ": 351,
    "ba": 268,
    "ao": 258,
    " ba": 36,
    "bao": 269,
    "ao ": 259,
    " bao": 37,
    "bao ": 270,
    "ê": 667,
    " n": 117,
    "nh": 484,
    "hi": 367,
    "iê": 417,
    "êu": 668,
    "u ": 599,
    " nh": 118,
    "nhi": 486,
    "hiê": 368,
    "iêu": 418,
    "êu ": 669,
    " nhi": 119,
    "nhiê": 487,
    "hiêu": 369,
    "iêu ": 419,
    "m": 448,
    "y": 634,
    " m": 105,
    "má": 468,
    "áy": 662,
    "y ": 635,
    " má": 111,
    "máy": 469,
    "áy ": 663,
    " máy": 112,
    "máy ": 470,
    "í": 674,
    "tí": 586,
    "ín": 675,
    "h ": 359,
    " tí": 149,
    "tín": 587,
    "ính": 676,
    "nh ": 485,
    " tín": 150,
    "tính": 588,
    "ính ": 677,
    "r": 528,
    " a": 28,
    "ac": 249,
    "ce": 288,
    "er": 334,
    "r ": 529,
    " ac": 29,
    "ace": 250,
    "cer": 289,
    "er ": 335,
    " ace": 30,
    "acer": 251,
    "cer ": 290,
    "ó": 678,
    "có": 302,
    "ó ": 679,
    " có": 53,
    "có ": 303,
    " có ": 54,
    "ế": 706,
    "th": 571,
    "hế": 387,
    "ế ": 707,
    " th": 144,
    "thế": 572,
    "hế ": 388,
    " thế": 145,
    "thế ": 573,
    "nà": 504,
    " nà": 124,
    "nào": 505,
    " nào": 125,
    "nào ": 506,
    "ô": 680,
    "tô": 589,
    "ôi": 681,
    " tô": 151,
    "tôi": 590,
    "ôi ": 682,
    " tôi": 152,
    "tôi ": 591,
    "mu": 460,
    "uố": 612,
    "ốn": 721,
    " mu": 106,
    "muố": 463,
    "uốn": 613,
    "ốn ": 722,
    " muố": 108,
    "muốn": 464,
    "uốn ": 614,
    "bi": 274,
    "iế": 420,
    "ết": 708,
    "t ": 565,
    " bi": 38,
    "biế": 275,
    "iết": 421,
    "ết ": 709,
    " biế": 39,
    "biết": 276,
    "iết ": 422,
    "ủ": 737,
    "củ": 307,
    "ủa": 738,
    "a ": 248,
    " củ": 57,
    "của": 308,
    "ủa ": 739,
    " của": 58,
    "của ": 309,
    "as": 263,
    "su": 556,
    "us": 610,
    "s ": 550,
    " as": 33,
    "asu": 264,
    "sus": 557,
    "us ": 611,
    " asu": 34,
    "asus": 265,
    "sus ": 558,
    "ho": 370,
    "cho": 293,
    "ho ": 371,
    " cho": 48,
    "cho ": 294,
    "v": 618,
    "le": 433,
    "en": 330,
    "no": 490,
    "ov": 516,
    "vo": 625,
    " le": 101,
    "len": 434,
    "eno": 332,
    "nov": 491,
    "ovo": 517,
    "vo ": 626,
    " len": 102,
    "leno": 435,
    "enov": 333,
    "novo": 492,
    "ovo ": 518,
    "ầ": 700,
    "cầ": 304,
    "ần": 701,
    " cầ": 55,
    "cần": 305,
    "ần ": 702,
    " cần": 56,
    "cần ": 306,
    "ộ": 726,
    "mộ": 474,
    "ột": 727,
    " mộ": 115,
    "một": 475,
    "ột ": 728,
    " một": 116,
    "một ": 476,
    "ọ": 715,
    "họ": 391,
    "ọc": 716,
    "c ": 287,
    " họ": 86,
    "học": 392,
    "ọc ": 717,
    " học": 87,
    "học ": 393,
    "ậ": 703,
    "tậ": 592,
    "ập": 704,
    " tậ": 153,
    "tập": 593,
    "ập ": 705,
    " tập": 154,
    "tập ": 594,
    "ợ": 734,
    "gợ": 355,
    "ợi": 735,
    " gợ": 74,
    "gợi": 356,
    "ợi ": 736,
    " gợi": 75,
    "gợi ": 357,
    "ý": 683,
    " ý": 166,
    "ý ": 684,
    " ý ": 167,
    "ga": 344,
    "am": 252,
    "mi": 457,
    " ga": 68,
    "gam": 345,
    "ami": 256,
    "min": 458,
    "ing": 411,
    " gam": 69,
    "gami": 346,
    "amin": 257,
    "ming": 459,
    "ing ": 412,
    "ì": 670,
    "mì": 471,
    "ìn": 671,
    " mì": 113,
    "mìn": 472,
    "ình": 672,
    " mìn": 114,
    "mình": 473,
    "ình ": 673,
    "ua": 600,
    "mua": 461,
    "ua ": 601,
    " mua": 107,
    "mua ": 462,
    "ư": 689,
    "ớ": 729,
    "dư": 320,
    "ướ": 691,
    "ới": 730,
    " dư": 62,
    "dướ": 321,
    "ưới": 692,
    "ới ": 731,
    " dướ": 63,
    "dưới": 322,
    "ưới ": 693,
    "_": 233,
    " _": 25,
    "__": 238,
    "_n": 244,
    "nu": 496,
    "um": 607,
    "mb": 450,
    "be": 271,
    "r_": 530,
    "_ ": 234,
    " __": 26,
    "__n": 242,
    "_nu": 245,
    "num": 497,
    "umb": 608,
    "mbe": 451,
    "ber": 272,
    "er_": 336,
    "r__": 531,
    "__ ": 239,
    " __n": 27,
    "__nu": 243,
    "_num": 246,
    "numb": 498,
    "umbe": 609,
    "mber": 452,
    "ber_": 273,
    "er__": 337,
    "r__ ": 532,
    "ệ": 712,
    "tr": 579,
    "ri": 540,
    "iệ": 423,
    "ệu": 713,
    " tr": 147,
    "tri": 582,
    "riệ": 541,
    "iệu": 424,
    "ệu ": 714,
    " tri": 148,
    "triệ": 583,
    "riệu": 542,
    "iệu ": 425,
    "1": 177,
    "6": 221,
    " 1": 1,
    "16": 184,
    "6g": 222,
    "gb": 347,
    "b ": 267,
    " 16": 4,
    "16g": 185,
    "6gb": 223,
    "gb ": 348,
    " 16g": 5,
    "16gb": 186,
    "6gb ": 224,
    " r": 130,
    "ra": 534,
    "m ": 449,
    " ra": 131,
    "ram": 536,
    "am ": 253,
    " ram": 132,
    "ram ": 537,
    "mà": 465,
    "àn": 646,
    " mà": 109,
    "màn": 466,
    "àn ": 647,
    " màn": 110,
    "màn ": 467,
    "hì": 379,
    " hì": 84,
    "hìn": 380,
    " hìn": 85,
    "hình": 381,
    ".": 173,
    "_.": 235,
    "._": 174,
    "__.": 240,
    "_._": 236,
    ".__": 175,
    "r__.": 533,
    "__._": 241,
    "_.__": 237,
    ".__n": 176,
    " i": 88,
    "nc": 479,
    " in": 95,
    "inc": 409,
    "nch": 480,
    "ch ": 292,
    " inc": 96,
    "inch": 410,
    "nch ": 481,
    "nt": 493,
    "te": 568,
    "int": 413,
    "nte": 494,
    "tel": 569,
    "el ": 326,
    " int": 97,
    "inte": 414,
    "ntel": 495,
    "tel ": 570,
    "co": 299,
    "or": 513,
    "re": 538,
    "e ": 324,
    " co": 51,
    "cor": 300,
    "ore": 514,
    "re ": 539,
    " cor": 52,
    "core": 301,
    "ore ": 515,
    "7": 225,
    "i7": 398,
    "7 ": 226,
    " i7": 91,
    "i7 ": 399,
    " i7 ": 92,
    " v": 160,
    "và": 627,
    "à ": 645,
    " và": 161,
    "và ": 628,
    " và ": 162,
    "nv": 499,
    "vi": 619,
    "id": 404,
    "di": 317,
    "ia": 402,
    " nv": 121,
    "nvi": 500,
    "vid": 620,
    "idi": 405,
    "dia": 318,
    "ia ": 403,
    " nvi": 122,
    "nvid": 501,
    "vidi": 621,
    "idia": 406,
    "dia ": 319,
    "rt": 543,
    "tx": 584,
    "x ": 630,
    " rt": 133,
    "rtx": 544,
    "tx ": 585,
    " rtx": 134,
    "rtx ": 545,
    "5": 213,
    "2": 190,
    " 5": 19,
    "51": 215,
    "12": 178,
    "2g": 194,
    " 51": 20,
    "512": 216,
    "12g": 179,
    "2gb": 195,
    " 512": 21,
    "512g": 217,
    "12gb": 180,
    "2gb ": 196,
    "ss": 553,
    "sd": 551,
    "d ": 311,
    " ss": 138,
    "ssd": 554,
    "sd ": 552,
    " ssd": 139,
    "ssd ": 555,
    "md": 453,
    " am": 31,
    "amd": 254,
    "md ": 454,
    " amd": 32,
    "amd ": 255,
    "z": 639,
    "ry": 546,
    "yz": 636,
    "ze": 641,
    " ry": 135,
    "ryz": 547,
    "yze": 637,
    "zen": 642,
    "en ": 331,
    " ryz": 136,
    "ryze": 548,
    "yzen": 638,
    "zen ": 643,
    "8": 227,
    " 8": 22,
    "8g": 228,
    " 8g": 23,
    "8gb": 229,
    " 8gb": 24,
    "8gb ": 230,
    " 2": 8,
    "25": 191,
    "56": 218,
    " 25": 9,
    "256": 192,
    "56g": 219,
    " 256": 10,
    "256g": 193,
    "56gb": 220,
    "4": 204,
    "k": 426,
    " 4": 16,
    "4k": 211,
    "k ": 427,
    " 4k": 17,
    "4k ": 212,
    " 4k ": 18,
    "i5": 396,
    "5 ": 214,
    " i5": 89,
    "i5 ": 397,
    " i5 ": 90,
    "1t": 187,
    "tb": 566,
    " 1t": 6,
    "1tb": 188,
    "tb ": 567,
    " 1tb": 7,
    "1tb ": 189,
    "hd": 360,
    "dd": 312,
    " hd": 77,
    "hdd": 362,
    "dd ": 313,
    " hdd": 79,
    "hdd ": 363,
    "gt": 352,
    " gt": 72,
    "gtx": 353,
    " gtx": 73,
    "gtx ": 354,
    "f": 338,
    " f": 64,
    "fu": 339,
    "ul": 602,
    " fu": 65,
    "ful": 340,
    "ull": 603,
    " ful": 66,
    "full": 341,
    "ull ": 604,
    "hd ": 361,
    " hd ": 78,
    "9": 231,
    "i9": 400,
    "9 ": 232,
    " i9": 93,
    "i9 ": 401,
    " i9 ": 94,
    "3": 200,
    " 3": 13,
    "32": 201,
    " 32": 14,
    "32g": 202,
    " 32g": 15,
    "32gb": 203,
    "2t": 197,
    " 2t": 11,
    "2tb": 198,
    " 2tb": 12,
    "2tb ": 199,
    "q": 524,
    " q": 127,
    "qh": 525,
    " qh": 128,
    "qhd": 526,
    " qhd": 129,
    "qhd ": 527,
    "vm": 622,
    "me": 455,
    "nvm": 502,
    "vme": 623,
    "me ": 456,
    " nvm": 123,
    "nvme": 503,
    "vme ": 624,
    " u": 157,
    "lt": 442,
    " ul": 158,
    "ult": 605,
    "ltr": 443,
    "tra": 580,
    "ra ": 535,
    " ult": 159,
    "ultr": 606,
    "ltra": 444,
    "tra ": 581,
    "14": 181,
    "44": 205,
    "4h": 208,
    "hz": 372,
    "z ": 640,
    " 14": 2,
    "144": 182,
    "44h": 206,
    "4hz": 209,
    "hz ": 373,
    " 144": 3,
    "144h": 183,
    "44hz": 207,
    "4hz ": 210,
    "ày": 652,
    "này": 507,
    "ày ": 653,
    " này": 126,
    "này ": 508,
    "ả": 697,
    "bả": 283,
    "ảo": 698,
    " bả": 44,
    "bảo": 284,
    "ảo ": 699,
    " bảo": 45,
    "bảo ": 285,
    " hà": 82,
    "hàn": 375,
    "ành": 648,
    " hàn": 83,
    "hành": 376,
    "ành ": 649,
    "â": 664,
    "lâ": 445,
    "âu": 665,
    " lâ": 103,
    "lâu": 446,
    "âu ": 666,
    " lâu": 104,
    "lâu ": 447,
    "hí": 382,
    "chí": 297,
    "hín": 383,
    " chí": 50,
    "chín": 298,
    "hính": 384,
    "ác": 656,
    "sác": 560,
    "ách": 657,
    " sác": 141,
    "sách": 561,
    "ách ": 658,
    "hư": 385,
    "ư ": 690,
    "như": 488,
    "hư ": 386,
    " như": 120,
    "như ": 489,
    "ể": 710,
    "hể": 389,
    "ể ": 711,
    "thể": 574,
    "hể ": 390,
    " thể": 146,
    "thể ": 575,
    "ở": 732,
    " ở": 171,
    "ở ": 733,
    " ở ": 172,
    "đ": 685,
    " đ": 168,
    "đâ": 686,
    " đâ": 169,
    "đâu": 687,
    " đâu": 170,
    "đâu ": 688
  },
  "response": null,
  "action_text": null
}